In [251]:
import talib
import numpy as np
import pandas as pd
import pandas_datareader as web
from colorama import Fore, Back, Style
import matplotlib.pyplot as plt
import matplotlib.dates as mdates
import xgboost as xgb
from xgboost import XGBRegressor, plot_importance
import seaborn as sns
%matplotlib inline
plt.style.use('seaborn')
import time
import datetime as dt
import os
from sklearn.preprocessing import MinMaxScaler
from keras.models import Sequential
from keras.layers import Dense
from sklearn.metrics import accuracy_score, precision_score, recall_score, roc_auc_score,roc_curve,confusion_matrix,classification_report
import warnings
warnings.filterwarnings("ignore")
import tensorflow as tf

In [252]:
df = pd.DataFrame()
df['X1'] = [0,10,20,30,40,50,60,70,80,90,100]
df['X2'] = [0,200,300,600,800,900,1000,1050,1100,1150,1200]
df['Y'] = [0,350,700,1300,1600,1750,1950,2100,2200,2300,2420]
df

     X1    X2     Y
0     0     0     0
1    10   200   350
2    20   300   700
3    30   600  1300
4    40   800  1600
5    50   900  1750
6    60  1000  1950
7    70  1050  2100
8    80  1100  2200
9    90  1150  2300
10  100  1200  2420

In [253]:
X = df.copy()
X = X.drop(['Y'],axis=1)
X['Y'] = df['Y']
y = X.iloc[:,-1]
Xtrain = X.iloc[:-2,:-1]
Xtest = X.iloc[-2:-1,:-1]
yshift = y.shift(-1)
ytrain = yshift.iloc[:-2]
ytest = yshift.iloc[-2:-1]

In [254]:
XX = df.iloc[-1:,:-1]
XX

     X1    X2
10  100  1200

In [255]:
Xtrain

   X1    X2
0   0     0
1  10   200
2  20   300
3  30   600
4  40   800
5  50   900
6  60  1000
7  70  1050
8  80  1100

In [256]:
y

0        0
1      350
2      700
3     1300
4     1600
5     1750
6     1950
7     2100
8     2200
9     2300
10    2420
Name: Y, dtype: int64

In [257]:
yshift

0      350.0
1      700.0
2     1300.0
3     1600.0
4     1750.0
5     1950.0
6     2100.0
7     2200.0
8     2300.0
9     2420.0
10       NaN
Name: Y, dtype: float64

In [234]:
Xtest

   X1    X2
9  90  1150

In [235]:
ytrain

0     350.0
1     700.0
2    1300.0
3    1600.0
4    1750.0
5    1950.0
6    2100.0
7    2200.0
8    2300.0
Name: Y, dtype: float64

In [236]:
ytest

9    2420.0
Name: Y, dtype: float64

In [237]:
model = xgb.XGBRegressor(n_estimators=200, learning_rate=0.5, gamma=0., subsample=0.6, colsample_bytree=0.4, max_depth=900)

model.fit( Xtrain, ytrain, early_stopping_rounds=15000, eval_set=[(Xtest, ytest)], verbose=0)

ytrain_pred = model.predict(Xtrain)
ytrain_pred

[15:54:58] WARNING: src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

array([ 349.99893,  700.0011 , 1299.9941 , 1600.0027 , 1749.9995 ,
       1950.0007 , 2099.999  , 2200.001  , 2300.0002 ], dtype=float32)

In [238]:
y_pred = model.predict(Xtest)
y_pred

array([2300.0002], dtype=float32)

In [250]:
model.predict(XX)

array([2300.0002], dtype=float32)

In [240]:
df['Y.S'] = pred
df['Y.S2'] = df['Y.S']
df = df.dropna()

df

     X1    X2     Y          Y.S         Y.S2
0     0     0     0   349.992645   349.992645
1    10   200   350   700.036377   700.036377
2    20   300   700  1299.967773  1299.967773
3    30   600  1300  1600.047363  1600.047363
4    40   800  1600  1749.996704  1749.996704
5    50   900  1750  1950.003296  1950.003296
6    60  1000  1950  2100.000488  2100.000488
7    70  1050  2100  2200.002441  2200.002441
8    80  1100  2200  2300.000000  2300.000000
9    90  1150  2300  2300.000000  2300.000000
10  100  1200  2420  2300.000000  2300.000000

In [241]:
Xtrain

   X1    X2
0   0     0
1  10   200
2  20   300
3  30   600
4  40   800
5  50   900
6  60  1000
7  70  1050
8  80  1100

In [242]:
Xtest

   X1    X2
9  90  1150

In [243]:
ytrain

0     350.0
1     700.0
2    1300.0
3    1600.0
4    1750.0
5    1950.0
6    2100.0
7    2200.0
8    2300.0
Name: Y, dtype: float64

In [244]:
ytest

9    2420.0
Name: Y, dtype: float64

In [245]:
X.iloc[:,:-1]

     X1    X2
0     0     0
1    10   200
2    20   300
3    30   600
4    40   800
5    50   900
6    60  1000
7    70  1050
8    80  1100
9    90  1150
10  100  1200

In [246]:
model.predict(X.iloc[:,:-1])

array([ 349.99893,  700.0011 , 1299.9941 , 1600.0027 , 1749.9995 ,
       1950.0007 , 2099.999  , 2200.001  , 2300.0002 , 2300.0002 ,
       2300.0002 ], dtype=float32)

In [247]:
df['%Futur'] = ((df['Y.S']-df['Y']) *100) / (df['Y'])
df['%Futur2'] = ((df['Y.S2']-df['Y']) *100) / (df['Y'])

In [248]:
df

     X1    X2     Y          Y.S         Y.S2      %Futur     %Futur2
0     0     0     0   349.992645   349.992645         inf         inf
1    10   200   350   700.036377   700.036377  100.010393  100.010393
2    20   300   700  1299.967773  1299.967773   85.709682   85.709682
3    30   600  1300  1600.047363  1600.047363   23.080566   23.080566
4    40   800  1600  1749.996704  1749.996704    9.374794    9.374794
5    50   900  1750  1950.003296  1950.003296   11.428760   11.428760
6    60  1000  1950  2100.000488  2100.000488    7.692333    7.692333
7    70  1050  2100  2200.002441  2200.002441    4.762021    4.762021
8    80  1100  2200  2300.000000  2300.000000    4.545455    4.545455
9    90  1150  2300  2300.000000  2300.000000    0.000000    0.000000
10  100  1200  2420  2300.000000  2300.000000   -4.958678   -4.958678

In [249]:
XX

     X1    X2
10  100  1200